package com.company;

import java.util.ArrayList;

public interface Executions {

    // TODO: 1.9 опять же невежливо принимать тип по классу в метод если нужен тебе лишь интерфейс
    // Тут легко зайдет List

    // TODO: 1.10 прочти как у тебя называется интерфейс. Это похоже на интерфейс?
    // совсем непонятно для чего он такой нужен и что он делает, принимает какое-то i и какой-то array.

    // TODO: 1.11 опять же общая концепция хромает, этот список неизвестно чего пронизывает все приложение
    // как с этим работать?
    void execute(int i, ArrayList<String> array);

}
